###@Rinkame
#4. Напишите программу, которая находит сумму всех чисел во вложенном списке, игнорируя вложенные списки.
a = [
    [1, 2,[2, 3], 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a2 = []
for i in a:
    a1 = []
    for j in i:
        if type(j) != list:
            a1.append(j)
    sum_a1 = sum(a1)
    a2.append(sum_a1)
sum_a = sum(a2)
print(a2)
print(sum_a)

a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    sum_i = sum(i)
    a1.append(sum_i)
sum_a = sum(a1)
print(a1)
print(sum_a)


#3. Найдите количество отрицательных чисел во вложенном списке.
a = [
    [1, 2, -3, 4, 5],
    [-2, 3, -4],
    [1, -2, -3, -4]
]

a2 = []
for i in a:
    n = 0
    a1 = []
    for j in i:
        if j < 0:
            n += 1
    a1.append(n)
    a2.append(a1)
print(a2)

#2. Напишите программу, которая возвращает список сумм элементов на каждой позиции во вложенных списках.
a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(sum(i))
print(a1)

#1. Напишите программу, которая заменяет отрицательные числа во вложенном списке на 0.
a = [
    [1, 2, -3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a2 = []
for i in a:
    a1 = []
    for j in i:
        if j < 0:
            j = 0
        a1.append(j)
    a2.append(a1)
print(a2)




### @RVMartirosov
# 4. Найдите максимальное значение в каждом вложенном списке и возвращает список с этими значениями.
a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(max(i))
print(a1)


#3. Напишите программу, которая удаляет дубликаты из каждого вложенного списка.
#3-3
a = [
    [1, 2, 1, 4, 5, 1],
    [2, 3, 2],
    [1, 2, 3, 4]
]
a2 = []
for i in a:
    a1 = []
    for j in i:
        if j not in a1:
            a1.append(j)
    a2.append(a1)
print(a2)

#3-2
a = [
    [1, 2, 1, 4, 5, 1],
    [2, 3, 2],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(list(set(i)))
print(a1)

#3-1
a = [
    [1, 2, 1, 4, 5, 1],
    [2, 3, 2],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append([*set(i)])
print(a1)



#2. Получите список из элементов, которые встречаются в каждом вложенном списке.


a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    for j in i:
        if j in a[0] and j in a[1] and j in a[2]:
            a1.append(sum(i))
print(a1)


#1. Напишите программу, которая находит сумму элементов в каждом вложенном списке и выводит их в отдельном списке.
a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(sum(i))
print(a1)


### Катерина
# 4. Создайте функцию, которая считает количество строк во вложенном списке.

a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(len(i))
print(a1)

# 3. Напишите программу, которая находит наименьший элемент в каждом вложенном списке и выводит их в отдельном списке.
a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(min(i))
print(a1)

#2. Найдите сумму элементов на главной диагонали квадратной матрицы, представленной в виде вложенного списка.


#1. Напишите программу, которая объединяет все вложенные списки в один одномерный список.
a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    for j in i:
        a1.append(j)
print(a1)


### Denwork21

# 4. Создайте функцию, которая считает количество строк во вложенном списке.

a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(len(i))
print(a1)

# 3. Напишите программу, которая находит наибольший элемент в каждом вложенном списке и выводит их в отдельном списке.
a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(max(i))
print(a1)



#2. Найдите среднее значение всех чисел во вложенном списке.
from statistics import mean
a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(mean(i))
print(a1)

a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(sum(i)/len(i))
print(a1)

# 1. Напишите программу, которая находит сумму всех элементов во вложенном списке.
a = [
    [1, 2, 3, 4, 5],
    [2, 3, 4],
    [1, 2, 3, 4]
]
a1 = []
for i in a:
    a1.append(sum(i))
print(a1)





