#07.13
#Напишите генератор, который выдает все подстроки заданного слова.

#Напишите генератор, который выдает первые 10 чисел Фибоначчи.

#Напишите генератор, который выдает все возможные перестановки трех цифр.

#Напишите генератор, который выдает все возможные перестановки трех цифр.

#Напишите генератор, который выдает все возможные перестановки букв в слове.

#Напишите генератор, который выдает все возможные подмножества заданного списка.

#Напишите генератор, который выдает все возможные перестановки элементов заданного списка.


