list1 = [1, 2, 3, 4]
list2 = [5, 6, 7, 8]
print(list1 + list2)
# Удалить все элементы списка, кратные заданному числу.
# 35. Оставить только элементы, находящиеся на четных позициях.
# 36. Оставить только элементы, удовлетворяющие определенному условию (например, больше 10).

#12. Поменять местами первый и последний элементы списка.
#13. Удалить элемент с определенным значением из списка.

#1. Найти сумму всех элементов в списке.
# 2. Найти среднее значение элементов в списке.
# 3. Найти минимальный элемент в списке.
# 4. Найти максимальный элемент в списке.
# 5. Посчитать количество элементов в списке.

lst = [1, 3, 2, 4, 0, -2, 9]
print(sum(lst))
print(sum(lst)/len(lst))
print(min(lst))
print(max(lst))
print(len(lst))