#Создайте список магазинов с продуктами и их ценами, а затем напишите функцию для
# вычисления общей стоимости покупок клиента.
#
store_inventory = {
    'яблоки': 1.0,
    'бананы': 0.5,
    'молоко': 2.0,
    'хлеб': 1.5,
    'яйца': 1.2,
    'вода': 0.75
}

# Создайте список классов школы, включающий информацию
# о студентах и учителях. Напишите функцию для подсчета общего количества студентов и учителей.
school_members = [
    {'name': 'Иван', 'role': 'студент'},
    {'name': 'Ольга', 'role': 'учитель'},
    {'name': 'Андрей', 'role': 'студент'},
    {'name': 'Мария', 'role': 'учитель'},
    {'name': 'Алексей', 'role': 'студент'}
]

